<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	
	<!-- *************************** OPTIONAL KEYS *************************** -->
	<!-- All keys below this comment are only optional but help the user with more information about the payload. -->
	
	<!-- This key should contain a URL to the download page of the application it's configuring. -->
	<key>pfm_app_url</key>
	<string>https://github.com/erikberglund/ProfileCreator/releases</string>
	
	<!-- This key should contain a URL to the documentation of the keys this application supports. (And from where you have taken the information to create this manifest)-->
	<key>pfm_documentation_url</key>
	<string>https://github.com/erikberglund/ProfileManifests/wiki/Manifest-Format</string>
	
	<!-- The scope where this payload is valid. -->
	<!-- If this payload is only for iOS and tvOS this should be set to only system.-->
	<!-- On macOS you include all scopes this payload is valid to install to. -->
	<!-- If this is not included, it will default to system AND user.-->
	<key>pfm_targets</key>
	<array>
		<string>system</string>
	</array>
	
	<!-- The platforms where this payload is valid. -->
	<!-- If this is not included, it will default to only macOS. -->
	<key>pfm_platforms</key>
	<array>
		<string>macOS</string>
	</array>
	
	<!-- *************************** REQUIRED KEYS *************************** -->
	<!-- All keys below this comment are required for this manifest to be loaded by the framework. -->

	<!-- A description of the payload. -->
	<key>pfm_description</key>
	<string>Control settings School Assembly Tool</string>
	
	<!-- The preference domain of the payload. This should be the same as PayloadType in the pfm_subkeys.-->
	<key>pfm_domain</key>
	<string>com.cantscript.schoolassembly</string>
	
	<!-- The format version is used by the application to know it can support all manifest keys in this manifest. -->
	<!-- Sometimes new keys are added, but those will not be supported by older versions of the application. -->
	<!-- To avoid creating invalid payloads because of that, the app will not load manifests with newer format versions that it can support. -->
	<!-- See this page for the current versions: https://github.com/erikberglund/ProfileManifests/wiki/Manifest-Format-Versions -->
	<key>pfm_format_version</key>
	<integer>1</integer>
	
	<!-- Date the manifest was last modified. This is used for manifest collision. -->
	<!-- Read more about that here: https://github.com/erikberglund/ProfileManifests/wiki/Manifest-Collision -->
	<key>pfm_last_modified</key>
	<date>2018-07-18T08:58:48Z</date>
	
	<!-- This is the title of the manifest -->
	<key>pfm_title</key>
	<string>School Assembly</string>
	
	<!-- This determines if there can be more than one payload in the profile for this PayloadType. -->
	<key>pfm_unique</key>
	<false/>
	
	<!-- This is the version number of this manifest, it's used to determine which manifest to load if two manifests with identical "pfm_domain" is found-->
	<key>pfm_version</key>
	<integer>1</integer>
	
	<!-- This is an array of all keys this payload can configure. They will be shown in order. -->
	<key>pfm_subkeys</key>
	<array>
		
		<!-- *************************** REQUIRED KEYS *************************** -->
		<!-- Currently the "base" keys for each payload must be defined in each manifest -->
		<!-- That is something I hope to move into the application and make the settings more simple. -->
		<!-- But for now, these are required to create a valid payload on export. -->
		
		<!-- PayloadDescription -->
		<!-- Description for the payload shown when the payload is installed. -->
		<dict>
			<key>pfm_default</key>
			<string>Configures and controls School Assembly Tool </string> <!-- CHANGE THIS VALUE -->
			<key>pfm_description</key>
			<string>Description of the payload.</string>
			<key>pfm_description_reference</key>
			<string>Optional. A human-readable description of this payload. This description is shown on the Detail screen.</string>
			<key>pfm_name</key>
			<string>PayloadDescription</string>
			<key>pfm_title</key>
			<string>Payload Description</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadDisplayName -->
		<!-- Display Name of the payload shown when the payload is installed. -->
		<dict>
			<key>pfm_default</key>
			<string>School Assembly</string> <!-- CHANGE THIS VALUE -->
			<key>pfm_description</key>
			<string>Name of the payload.</string>
			<key>pfm_description_reference</key>
			<string>A human-readable name for the profile payload. This name is displayed on the Detail screen. It does not have to be unique.</string>
			<key>pfm_name</key>
			<string>PayloadDisplayName</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Display Name</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadIdentifier -->
		<!-- The base identifier this payload should use. This will then be expanded by the application to add the root identifier + the payload UUID to create a unique identifier automatically. -->
		<dict>
			<key>pfm_default</key>
			<string>com.cantscript.schoolassembly</string> <!-- CHANGE THIS VALUE TO THE SAME AS pfm_domain and PayloadType -->
			<key>pfm_description</key>
			<string>A unique identifier for the payload, dot-delimited.  Usually root PayloadIdentifier+subidentifier</string>
			<key>pfm_description_reference</key>
			<string>A reverse-DNS-style identifier for the specific payload. It is usually the same identifier as the root-level PayloadIdentifier value with an additional component appended.</string>
			<key>pfm_name</key>
			<string>PayloadIdentifier</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Identifier</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadType -->
		<!-- This is the PayloadType of the payload. -->
		<dict>
			<key>pfm_default</key>
			<string>com.cantscript.schoolassembly</string> <!-- CHANGE THIS VALUE TO THE SAME AS pfm_domain and PayloadIdentifier -->
			<key>pfm_description</key>
			<string>The type of the payload, a reverse dns string.</string>
			<key>pfm_description_reference</key>
			<string>The payload type.</string>
			<key>pfm_name</key>
			<string>PayloadType</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Type</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadUUID -->
		<!-- This is the PayloadUUID and it will be generated automatically. You should NOT edit this. -->
		<dict>
			<key>pfm_description</key>
			<string>Unique identifier for the payload (format 01234567-89AB-CDEF-0123-456789ABCDEF)</string>
			<key>pfm_description_reference</key>
			<string>A globally unique identifier for the payload. The actual content is unimportant, but it must be globally unique. In macOS, you can use uuidgen to generate reasonable UUIDs.</string>
			<key>pfm_format</key>
			<string>^[0-9A-Za-z]{8}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{4}-[0-9A-Za-z]{12}$</string>
			<key>pfm_name</key>
			<string>PayloadUUID</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload UUID</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- PayloadVersion -->
		<!-- This is the version of the payload. You should NOT edit this. -->
		<dict>
			<key>pfm_default</key>
			<integer>1</integer>
			<key>pfm_description</key>
			<string>The version of the whole configuration profile.</string>
			<key>pfm_description_reference</key>
			<string>The version number of the individual payload.
A profile can consist of payloads with different version numbers. For example, changes to the VPN software in iOS might introduce a new payload version to support additional features, but Mail payload versions would not necessarily change in the same release.</string>
			<key>pfm_name</key>
			<string>PayloadVersion</string>
			<key>pfm_require</key>
			<string>always</string>
			<key>pfm_title</key>
			<string>Payload Version</string>
			<key>pfm_type</key>
			<string>integer</string>
		</dict>
		
		<!-- PayloadOrganization -->
		<!-- This is the organization of the payload. You should NOT edit this. -->
		<dict>
			<key>pfm_description</key>
			<string>This value describes the issuing organization of the profile, as displayed to the user</string>
			<key>pfm_name</key>
			<string>PayloadOrganization</string>
			<key>pfm_title</key>
			<string>Payload Organization</string>
			<key>pfm_type</key>
			<string>string</string>
		</dict>
		
		<!-- *************************** APPLICATION KEYS *************************** -->
		<!-- You should add all keys this payload can manage below this comment. -->


		<!-- Example: Description -->
		<!-- This example shows how to include descriptions -->
		<dict>
			<key>pfm_name</key>
			<string>runLocal</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Run Script Locally</string>
			<key>pfm_description</key>
			<string>If you want to run script locally for testing set run as local to true. Displays School Assembly in window and prompts for password in terminal.</string>
			<key>pfm_default</key>
			<string>True</string>
		</dict>
		
		<dict>
			<key>pfm_name</key>
			<string>appLogging</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_title</key>
			<string>Verbose App Logging</string>
			<key>pfm_description</key>
			<string>Create more output when script is parsing profile into script variables for app arrays.</string>
			<key>pfm_default</key>
			<string>True</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>userGreeting</string>
			<key>pfm_type</key>
			<string>boolean</string>
			<key>pfm_default</key>
			<string>True</string>
			<key>pfm_title</key>
			<string>User Greeting</string>
			<key>pfm_description</key>
			<string>If true, script will use currently logged in user name in the greeting window. if false, it will be set to the computer name.</string>
		</dict>

		
		<dict>
			<key>pfm_name</key>
			<string>mainMessage</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Welcome Message</string>
			
			<!-- This value will be used as the description shown below the Tile for the key. -->
			<key>pfm_description</key>
			<string>Set the welcome message for the main School Assembly window. Markdown can be used for for formatting.</string>
		</dict>
		
		<dict>
			<key>pfm_name</key>
			<string>completeTitle</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Title of Completion Window</string>
			
			<!-- This value will be used as the description shown below the Tile for the key. -->
			<key>pfm_description</key>
			<string>Set the title of the window displayed once workflow is complete</string>
		</dict>

		<dict>
			<key>pfm_name</key>
			<string>completeMessage</string>
			<key>pfm_type</key>
			<string>string</string>
			<key>pfm_title</key>
			<string>Message in Completion Window</string>
			
			<!-- This value will be used as the description shown below the Tile for the key. -->
			<key>pfm_description</key>
			<string>Set the title of the window displayed once workflow is complete. Markdown can be used for for formatting.</string>
		</dict>

		
		<!-- Example: Array of Dictionaries -->
		<!-- This example shows how to define an array of dictionaries -->
		<dict>
			<key>pfm_name</key>
			<string>AppInstalls</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_title</key>
			<string>Apps to Install</string>
			<key>pfm_description</key>
			<string>Apps to Install with Installomator.</string>
			<key>pfm_require</key>
			<string>always</string>
						<!-- This key defines the contents of the array. As this is an array, it should only include ONE (1) subkey, as the array should only contain a single type.-->
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>dictionary</string>
					
					<!-- The dictionary subkeys is like any other pfm_subkey and should contain all keys the dictionary can configure. -->
					<!-- Remember to set pfm_required wherever that is needed. -->
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>appIcon</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Icon Location</string>
							<key>pfm_description</key>
							<string>Location of icon to display.</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>appLabel</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Installomator Label</string>
							<key>pfm_description</key>
							<string>The installomator label of the app to install.</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>appName</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Display Name</string>
							<key>pfm_description</key>
							<string>The name of the app as you wish to display it in the School Assembly window.</string>
						</dict>
						
					</array>
				</dict>
			</array>
		</dict>
		
		<dict>
			<key>pfm_name</key>
			<string>AppWatch</string>
			<key>pfm_type</key>
			<string>array</string>
			<key>pfm_title</key>
			<string>Apps Watch Paths</string>
			<key>pfm_description</key>
			<string>Set watchpaths for apps installed via VPP, inhouse macOS apps or App Installers.</string>
			<key>pfm_require</key>
			<string>always</string>
			<!-- This key defines the contents of the array. As this is an array, it should only include ONE (1) subkey, as the array should only contain a single type.-->
			<key>pfm_subkeys</key>
			<array>
				<dict>
					<key>pfm_type</key>
					<string>dictionary</string>
					
					<!-- The dictionary subkeys is like any other pfm_subkey and should contain all keys the dictionary can configure. -->
					<!-- Remember to set pfm_required wherever that is needed. -->
					<key>pfm_subkeys</key>
					<array>
						<dict>
							<key>pfm_name</key>
							<string>appIcon</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Icon Location</string>
							<key>pfm_description</key>
							<string>Location of icon to display.</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>appLocation</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Path to Watch</string>
							<key>pfm_description</key>
							<string>The location of the app you wish to watch.</string>
						</dict>
						<dict>
							<key>pfm_name</key>
							<string>appName</string>
							<key>pfm_type</key>
							<string>string</string>
							<key>pfm_title</key>
							<string>Display Name</string>
							<key>pfm_description</key>
							<string>The name of the app as you wish to display it in the School Assembly window.</string>
						</dict>
					</array>
				</dict>
			</array>
		</dict>
	</array>
</dict>
	
	

</plist>
